# -*- coding: utf-8 -*-
# @Time    : 2021/6/19 23:02
# @Author  : WANGWEILI
# @FileName: 字符串操作.py
# @Software: PyCharm
"""
字符串+
字符串*
字符串切片
"""
var1 = '君不见，黄河之水天上来，奔流到海不复回。'
var2 = '君不见，高堂明镜悲白发，朝如青丝暮成雪。'
vars = var1 + var2
res = '李白' + '将进酒'
print(vars)
print(res)
var = '及你太美'
print(var * 5)  # 及你太美及你太美及你太美及你太美及你太美

# 字符串切片
# 字符串的索引操作，只能使用[]下标访问，不能修改
# str[开始值：结束值：步进值]
var1 = '君不见，黄河之水天上来，奔流到海不复回。'
# 全部输出
print(var1[::])  # 君不见，黄河之水天上来，奔流到海不复回。
# 只取一个下标的值
print(var1[5])  # 河
# 取开始-结束内的下标的值，不包含末尾
print(var1[1:5])  # 不见，黄
# 从下标2开始取，一直到下标为10之前，能取到1，取不到10
print(var1[2:10:2])  # 不，河水上，
# 取全部的字符串，隔一个取一个
print(var1[::2])  # 君见黄之天来奔到不回
# 取全部的字符串，字符串倒过来
print(var1[::-1])  # 。回复不海到流奔，来上天水之河黄，见不君，
# 从初始值那里开始一直到末尾的字符串，
print(var1[1::1])  # 不见，黄河之水天上来，奔流到海不复回。
# 从初始值那里开始一直到末尾的字符串，隔一个取一个
print(var1[1::2])  # 不，河水上，流海复。
# 从初始值那里开始一直到末尾的字符串，倒着取
print(var1[1::-2])  # 不
print(var1[10::-2])  # 来天之黄见君

print('*' * 50)
# 字符串格式化方法
# format()格式化字符串
# 1.普通方式
a = '李白'
vars = '{}乘舟将欲行，忽闻岸上踏歌声'.format(a)
print(vars)  # 李白乘舟将欲行，忽闻岸上踏歌声
# 2.索引传参
vars = '{1}乘舟将欲行，忽闻岸{2}上踏歌声{0}'.format('a', 'b', 'c')
print(vars)  # b乘舟将欲行，忽闻岸c上踏歌声a
# 3.关键字传参
vars = '{a}乘舟将欲行，忽闻岸{b}上踏歌声{c}'.format(a='李白', b='gesheng', c='huhai')
print(vars)  # 李白乘舟将欲行，忽闻岸gesheng上踏歌声huhai
# 4.容器传参
vars = '豪放派：{0[0]},婉约派：{0[1]}，蛋黄派：{0[2]}'.format(['李白', '辛弃疾', '达利园'])
print(vars)  # 豪放派：李白,婉约派：辛弃疾，蛋黄派：达利园
data = {'a': '辛弃疾', 'b': '李白'}

vars = '{a}乘舟将欲行，忽闻岸{b}上踏歌声'.format(**data)
print(vars)  # 辛弃疾乘舟将欲行，忽闻岸李白上踏歌声

vars = f'{data["a"]}乘舟将欲行，忽闻岸{data["b"]}上踏歌声'
print(vars)  # 辛弃疾乘舟将欲行，忽闻岸李白上踏歌声

vars = '圆周率是多少：{:.2f}'.format(3.1415926)
print(vars)  # 圆周率是多少：3.14 限定小数位数
